import streamlit as st
import pandas as pd
import numpy as np


# 餐厅数据
restaurants_data = {
    "餐厅":['牛天宝','大福食堂','破烂泡泡','大山自助烤肉','苏格拉岛自助'],
    "类型":["自助餐", "中餐", "自助餐", "自助餐", "自助餐"],
    "评分":[4.6, 4.8, 4.7, 4.7, 4.5],
    "人均消费(元)": [70, 50,60,80, 90],
}    
data = {
    "latitude":[22.832202,22.814752,22.816595,22.813986,22.813919],
    "longitude":[108.286485,108.320848,108.321551,108.321535,108.321484]
}
df = pd.DataFrame(data)
st.map(df)

import streamlit as st
import pandas as pd

# 定义数据,以便创建数据框
data = {    
    '牛天宝':[200, 150, 180,180,120,130,150,120, 160,123,150, 200],
    '大福食堂':[120, 160, 123,150,200,190,160,160,150,180,180,200],
    '破烂泡泡':[110, 100, 160,190,160,160,150, 180,180,160,170,180],
    '大山自助烤肉':[150, 200, 230,200,190,180,180,200,180,160,170,160],
    '苏格拉岛自助':[120,240, 143,150, 200, 230,200,190,180,180,200,170],
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series(['01月', '02月', '03月', '04月', '05月', '06月', '07月', '08月', '09月', '10月', '11月', '12月'], name='月份')
# 将新索引应用到数据框上
df.index = index

#展示数据
st.dataframe(df)
st.table(df)

#折线图
st.line_chart(df)
#柱状图
st.bar_chart(df)

#准备地图坐标点数据
map_data = {
     "latitude":[22.832202,22.814752,22.816595,22.813986,22.813919],
    "longitude":[108.286485,108.320848,108.321551,108.321535,108.321484]
}

st.map(pd.DataFrame(map_data))


import streamlit as st
import pandas as pd

crowd_data = pd.DataFrame({
    "时间":['01月', '02月', '03月', '04月', '05月', '06月', '07月', '08月', '09月', '10月', '11月', '12月'],
    "牛天宝":[30,95,50,70,40,85,60,25,85,65,35,90],
    "大福食堂":[65,35,90,65,40,80,50,45,75,55,66,84],
    "破烂泡泡":[34,57,89,12,45,78,23,67,90,56,82,39],
    "大山自助烤肉":[47,83,19,62,95,31,76,24,58,13,69,40],
    "苏格拉岛自助":[28,91,55,17,74,36,80,42,66,35,59,88]
})


#使用data的数据创建数据帧dataFrame

st.line_chart(crowd_data.set_index('时间'))
